# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 12  # number of classes
# Model scaling factors
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple

# Anchor (coco)
anchors:
  - [10,13, 16,30, 33,23]       # P3/8x downsampling (small targets)
  - [30,61, 62,45, 59,119]      # P4/16x downsampling (medium targets)
  - [116,90, 156,198, 373,326]  # P5/32x downsampling (large targets)

# YOLOv5 Backbone
backbone:
  # [from, number,  module,  args]
  [[-1,  1,   Conv,  [64, 6, 2, 2]],  # 0-P1/2x downsampling
   [-1,  1,   Conv,  [128, 3, 2]],    # 1-P2/4x downsampling
   [-1,  3,   C3,    [128]],          # 2
   [-1,  1,   Conv,  [256, 3, 2]],    # 3-P3/8x downsampling
   [-1,  6,   C3,    [256]],          # 4
   [-1,  1,   Conv,  [512, 3, 2]],    # 5-P4/16x downsampling
   [-1,  9,   C3,    [512]],          # 6
   [-1,  1,   Conv,  [1024, 3, 2]],   # 7-P5/32x downsampling
   [-1,  3,   C3,    [1024]],         # 8
   [-1,  1,   SPPF,  [1024, 5]],      # 9
  ]

# YOLOv5 Neck + Head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11 Upsample features
   [[-1, 6], 1, Concat, [1]],  # 12 Concatenate P4 features (layer 6) with previous layer features
   [-1, 3, C3, [512, False]],  # 13 Fusion of concatenated features

   [-1, 1, Conv, [256, 1, 1]], # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 15 Upsample features
   [[-1, 4], 1, Concat, [1]],  # 16 Concatenate P3 features (layer 4) with previous layer features
   [-1, 3, C3, [256, False]],  # 17 Fusion of concatenated features (P3/8-small targets)

   [-1, 1, Conv, [256, 3, 2]], # 18
   [[-1, 14], 1, Concat, [1]], # 19 Concatenate fused P4 features (layer 14) with previous layer features
   [-1, 3, C3, [512, False]],  # 20 Fusion of concatenated features (P4/16-medium targets)

   [-1, 1, Conv, [512, 3, 2]],  # 21
   [[-1, 10], 1, Concat, [1]],  # 22 Concatenate fused P5 features (layer 10) with previous layer features
   [-1, 3, C3, [1024, False]],  # 23 Fusion of concatenated features (P5/32-large targets)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Use P3/P4/P5 features for prediction
  ]
